Tekla.Structures.DirectManipulation.Adapter.Interaction.InputHandler
The Tekla.Structures.DirectManipulation.Adapter.Interaction.InputHandler class provides methods of getting user inputs.
Tekla.BIM.DirectManipulation.Adapters.IInputHandler

Tekla.Structures.DirectManipulation.Adapter.Interaction.InputHandler.GetDistance(System.Double)
Gets the user input as distance value.
initialValue: The initial value.
Returns: The user input as distance value, or null if the operation was cancelled.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InputHandler.GetAngle(System.Double)
Gets the user input as angle value.
initialValue: The initial angle value in current units.
Returns: The user input as angle value, or null if the operation was cancelled.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InputHandler.GetDimension(Tekla.Common.Geometry.Segment3,Tekla.BIM.DirectManipulation.Services.Manipulators.DimensionInputDirection,Tekla.BIM.DirectManipulation.Services.Manipulators.DimensionInputDirection)
Gets the dimension input.
dimension: The dimension.
defaultDirection: The default direction.
visibleInputDirection: The supported input direction.
Returns:
The dimension input, if any.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InputHandler.GetText(System.String)
Gets the input text.
initialValue: The initial value.
Returns: The input text; or null if the users cancel the operation.

Tekla.Structures.DirectManipulation.Adapter.Interaction.InputHandler.Interrupt
Interrupts any user input.